%% 乘车区出租车通行能力图
Ex = 1:0.1:10;
By = 0:0.1:10
[E,B] = meshgrid(Ex,By);

% T = (2.*B.*3600)./(6.*(B-1)./(E.*0.8) + 30 + 3.*2.*B + 0.1 .* (2/5 .* ((2.*B).^(5./2)-1)) + 6.*B./8);

cap = 2.*B.*3600./((B-1) .* 6./(E.*8) + 30 + 6/8.*B  +3.*(2.*B-1) + (2.*B.*B-B)/5);
figure;
mesh(E,B,cap);

xlabel('单车道上车口数量/个');
ylabel('单车道单批次车数/辆');
title('乘车区出租车通行能力图');


%% “乘车区”出租车平均逗留时长（秒）
Ex = 1:1:10;
By = 1:1:10;
[E,B] = meshgrid(Ex,By);


cap = 2.*B.*3600./((B-1) .* 6./(E.*8) + 30 + 6/8.*B  +3.*(2.*B-1) + (2.*B.*B-B)/5);
w = 1./ (2.*B.*3600./cap - 0.08);

figure;
mesh(E,B,w);

xlabel('单车道上车口数量（个）');
ylabel('单车道单批次出租车数（辆）');
title('“乘车区”出租车平均逗留时长（秒）');
